app/controllers/activities_controller.rb

INSERT INTO "activities" ("updated_at", "end", "start", "note", "distance", "activity_type", "created_at") VALUES('2010-05-16 17:55:15', NULL, NULL, NULL, NULL, NULL, '2010-05-16 17:55:15')
---
  def create
    @activity = Activity.new(params[:activity])

    respond_to do |format|
      if @activity.save

SELECT * FROM "activities" WHERE ("activities"."id" = 980190962)
---
  def update
    @activity = Activity.find(params[:id])

SELECT * FROM "activities" WHERE ("activities"."id" = 980190962)
DELETE FROM "activities" WHERE "id" = 980190962
---
  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy